CSI API ETABS v1

# eMatTypeTendon Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eMatTypeTendon

    Public Enumeration eMatTypeTendon

    Dim instance As eMatTypeTendon

    public enum class eMatTypeTendon

    type eMatTypeTendon

Members

| Member name| Value| Description
---|---|---|---
| ASTM_A416Gr250| 1|
| ASTM_A416Gr270| 2|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com